In [2]:
import pandas as pd

In [2]:
df = pd.read_csv('Combined_DS_v10.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   SurveyDate                  999 non-null    object
 1   FormalEducation             999 non-null    object
 2   ConvertedSalary             665 non-null    float64
 3   Hobby                       999 non-null    object
 4   Country                     999 non-null    object
 5   StackOverflowJobsRecommend  487 non-null    float64
 6   VersionControl              999 non-null    object
 7   Age                         999 non-null    int64
 8   Years Experience            999 non-null    int64
 9   Gender                      693 non-null    object
 10  RawSalary                   665 non-null    object
dtypes: float64(2), int64(2), object(7)
memory usage: 86.0+ KB

In [5]:
#xem tên cột
df.columns

Index(['SurveyDate', 'FormalEducation', 'ConvertedSalary', 'Hobby', 'Country',
       'StackOverflowJobsRecommend', 'VersionControl', 'Age',
       'Years Experience', 'Gender', 'RawSalary'],
      dtype='object')

In [6]:
# xem danh sách dữ liệu của cột
# prin the data type of each column
print(df.dtypes)

SurveyDate                     object
FormalEducation                object
ConvertedSalary               float64
Hobby                          object
Country                        object
StackOverflowJobsRecommend    float64
VersionControl                 object
Age                             int64
Years Experience                int64
Gender                         object
RawSalary                      object
dtype: object

In [7]:
# Chọn các cột có loại dữ liệu cụ thể
# Create subset of only the numberic columns

In [9]:
numeric_df = df.select_dtypes(include=['int64', 'float64'])
numeric_df

     ConvertedSalary  StackOverflowJobsRecommend  Age  Years Experience
0                NaN                         NaN   21                13
1            70841.0                         7.0   38                 9
2                NaN                         8.0   45                11
3            21426.0                         NaN   46                12
4            41671.0                         8.0   39                 7
..               ...                         ...  ...               ...
994              NaN                         NaN   45                10
995          58746.0                         8.0   27                16
996          55000.0                         NaN   54                16
997              NaN                         NaN   23                 9
998        1000000.0                         NaN   18                 7

[999 rows x 4 columns]

In [1]:
# Mã hoá thuộc tính phân loại (encoding categorical feature) : sử dụng
# các biến phân loại trong mô hình ML
# => để biểu diễn chúng theo dạng định lượng
# Một số phương pháp:
#     - one hot encoder/dummy encoder hay label encoder

In [3]:
house_area = pd.DataFrame({'Area': [21, 32, 64, 56, 128, 160],
                          'Type': ["Small", 'Small', 'Medium', 'Medium', 'Large', 'Large']})

In [4]:
house_area

   Area    Type
0    21   Small
1    32   Small
2    64  Medium
3    56  Medium
4   128   Large
5   160   Large

In [5]:
from sklearn import preprocessing

In [6]:
label_encoder_s = preprocessing.LabelEncoder()

In [8]:
house_area['Type_encoder'] = label_encoder_s.fit_transform(house_area['Type'])
house_area

   Area    Type  Type_encoder
0    21   Small             2
1    32   Small             2
2    64  Medium             1
3    56  Medium             1
4   128   Large             0
5   160   Large             0

In [ ]:
# label encoding

In [9]:
import seaborn as sns

In [10]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [11]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [12]:
#label_encoder object knows how to understand word labels
label_encoder = preprocessing.LabelEncoder()

# Encode labels in column 'species' => 'species_type'
iris['species_type'] = label_encoder.fit_transform(iris['species'])
iris['species_type'].unique()

array([0, 1, 2])

In [16]:
# Đối với các biến phân loại ko tồn tại mối quan hệ thứ tự, 
# integer encoder là ko đủ

# Trong trường hợp này, one-hot encoder/dummy encoder

# one-hot encoder
# Biến đã mã hoá số nguyên đc loại bỏ và biến nhị phân mới đc thêm vào cho một giá trị số nguyên duy nhất
# ví dụ: 'color' variable, có 3 loại => se có 3 biến nhị phân, (binary variable) :
#         giá trị '1' đc thay thế trong binary variable
# cho color và giá trị '0' cho các color còn lại

# red,   green,   blue
# 1      0        0
# 0      1        0
# 0      0        1

# => kết quả trả về numpy array => cần có thể chuyển lại thành dataframe

In [31]:
students = pd.DataFrame({'Name': ['John', 'Lucy', 'Army', 'Lora'],
                        'Sex':['Male', 'Female', 'Other', 'Male'],
                        'Age':[16,17,16,17]})

In [18]:
students

   Name     Sex  Age
0  John    Male   16
1  Lucy  Female   17
2  Army   Other   16
3  Lora    Male   17

In [32]:
from sklearn.preprocessing import OneHotEncoder

In [33]:
one_hot_encoder = OneHotEncoder()
one_hot_encoder.fit(students[['Sex']])
student_sex_onehot = one_hot_encoder.transform(students[['Sex']]).toarray()

In [34]:
one_hot_encoder.categories_

[array(['Female', 'Male', 'Other'], dtype=object)]

In [35]:
one_hot_encoder.categories_[0]

array(['Female', 'Male', 'Other'], dtype=object)

In [36]:
dfOneHot = pd.DataFrame(student_sex_onehot, columns = ['S'+i for i in one_hot_encoder.categories_[0]])

In [37]:
dfOneHot

   SFemale  SMale  SOther
0      0.0    1.0     0.0
1      1.0    0.0     0.0
2      0.0    0.0     1.0
3      0.0    1.0     0.0

In [38]:
student_sex_onehot = pd.concat([students, dfOneHot], axis=1)
student_sex_onehot

   Name     Sex  Age  SFemale  SMale  SOther
0  John    Male   16      0.0    1.0     0.0
1  Lucy  Female   17      1.0    0.0     0.0
2  Army   Other   16      0.0    0.0     1.0
3  Lora    Male   17      0.0    1.0     0.0

In [39]:
# dummy encoder, kết quả trả về các cột mới trong dataframe
students

   Name     Sex  Age
0  John    Male   16
1  Lucy  Female   17
2  Army   Other   16
3  Lora    Male   17

In [40]:
student_sex_hot = pd.get_dummies(students, columns=['Sex'], prefix='S')

In [41]:
student_sex_hot

   Name  Age  S_Female  S_Male  S_Other
0  John   16         0       1        0
1  Lucy   17         1       0        0
2  Army   16         0       0        1
3  Lora   17         0       1        0

In [42]:
# Muốn xoá cột đầu - Female
student_dummy = pd.get_dummies(students, columns=['Sex'], prefix='S', drop_first=True)
student_dummy

   Name  Age  S_Male  S_Other
0  John   16       1        0
1  Lucy   17       0        0
2  Army   16       0        1
3  Lora   17       1        0

In [43]:
# import so survey
so_survey_df = pd.read_csv('Combined_DS_v10.csv')

In [45]:
so_survey_df.head()

,SurveyDate,FormalEducation,ConvertedSalary,Hobby,Country,StackOverflowJobsRecommend,VersionControl,Age,Years Experience,Gender,RawSalary
0,2/28/2018 20:20,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,South Africa,NaN,Git,21,13,Male,NaN
1,6/28/2018 13:26,Bachelor's degree (BA. BS. B.Eng.. etc.),70841.0,Yes,Sweeden,7.0,Git;Subversion,38,9,Male,"70,841.00"
2,6/6/2018 3:37,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,No,Sweeden,8.0,Git,45,11,NaN,NaN
3,5/9/2018 1:06,Some college/university study without earning ...,21426.0,Yes,Sweeden,NaN,Zip file back-ups,46,12,Male,"21,426.00"
4,4/12/2018 22:41,Bachelor's degree (BA. BS. B.Eng.. etc.),41671.0,Yes,UK,8.0,Git,39,7,Male,"£41,671.00"

In [47]:
so_numeric_df = so_survey_df.select_dtypes(include=['int64', 'float64'])

In [48]:
so_numeric_df.columns

Index(['ConvertedSalary', 'StackOverflowJobsRecommend', 'Age',
       'Years Experience'],
      dtype='object')

In [49]:
# print the count values for each category (country column)
countries = so_survey_df.Country

In [50]:
country_counts = countries.value_counts()

In [51]:
country_counts

South Africa    166
USA             164
Spain           134
Sweeden         119
France          115
Russia           97
UK               95
India            95
Ukraine           9
Ireland           5
Name: Country, dtype: int64

In [52]:
# create a mask for only categories that occur less than 10 times
mask = countries.isin(country_counts[country_counts < 10].index)
print(mask.head())

0    False
1    False
2    False
3    False
4    False
Name: Country, dtype: bool

In [53]:
countries[mask] = 'Other'
pd.value_counts(countries)

C:\Users\lab2-28\AppData\Local\Temp\ipykernel_10844\2463213676.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  countries[mask] = 'Other'

South Africa    166
USA             164
Spain           134
Sweeden         119
France          115
Russia           97
UK               95
India            95
Other            14
Name: Country, dtype: int64

In [54]:
so_survey_df['Country'][mask] = 'Other'

C:\Users\lab2-28\AppData\Local\Temp\ipykernel_10844\2391850715.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  so_survey_df['Country'][mask] = 'Other'

In [55]:
counts = so_survey_df['Country'].value_counts()

In [56]:
counts

South Africa    166
USA             164
Spain           134
Sweeden         119
France          115
Russia           97
UK               95
India            95
Other            14
Name: Country, dtype: int64

In [57]:
# Assuming your existing dataframe is named 'df'
so_numeric_df['base job'] = so_numeric_df['ConvertedSalary'].notnull().astype(int)

# Replace null values with 0
so_numeric_df['base job'].fillna(0, inplace=True)

In [58]:
so_numeric_df

,ConvertedSalary,StackOverflowJobsRecommend,Age,Years Experience,base job
0,NaN,NaN,21,13,0
1,70841.0,7.0,38,9,1
2,NaN,8.0,45,11,0
3,21426.0,NaN,46,12,1
4,41671.0,8.0,39,7,1
...,...,...,...,...,...
994,NaN,NaN,45,10,0
995,58746.0,8.0,27,16,1
996,55000.0,NaN,54,16,1
997,NaN,NaN,23,9,0
998,1000000.0,NaN,18,7,1

In [59]:
so_numeric_df['Paid_Job'] = 0

In [60]:
so_numeric_df.loc[so_numeric_df['ConvertedSalary'] > 0, 'Paid_Job']=1

In [61]:
so_numeric_df

,ConvertedSalary,StackOverflowJobsRecommend,Age,Years Experience,base job,Paid_Job
0,NaN,NaN,21,13,0,0
1,70841.0,7.0,38,9,1,1
2,NaN,8.0,45,11,0,0
3,21426.0,NaN,46,12,1,1
4,41671.0,8.0,39,7,1,1
...,...,...,...,...,...,...
994,NaN,NaN,45,10,0,0
995,58746.0,8.0,27,16,1,1
996,55000.0,NaN,54,16,1,1
997,NaN,NaN,23,9,0,0
998,1000000.0,NaN,18,7,1,1

In [62]:
# Binning value: biến liên tục, quan tâm đến nhóm
# -> khi độ chính xác ko đc quan tâm lớn

In [63]:
so_numeric_df['equal_binned'] = pd.cut(so_survey_df['ConvertedSalary'], 5)
so_numeric_df['equal_binned'].unique()

[NaN, (-2000.0, 400000.0], (800000.0, 1200000.0], (400000.0, 800000.0], (1600000.0, 2000000.0]]
Categories (5, interval[float64, right]): [(-2000.0, 400000.0] < (400000.0, 800000.0] < (800000.0, 1200000.0] < (1200000.0, 1600000.0] < (1600000.0, 2000000.0]]

In [64]:
so_numeric_df[['equal_binned', 'ConvertedSalary']].head()

          equal_binned  ConvertedSalary
0                  NaN              NaN
1  (-2000.0, 400000.0]          70841.0
2                  NaN              NaN
3  (-2000.0, 400000.0]          21426.0
4  (-2000.0, 400000.0]          41671.0

In [65]:
import numpy as np

In [66]:
bins = [-np.inf, 10000, 50000, 100000, 150000, np.inf]
#bin labels
labels = ['Very low', 'Low', 'Medium', 'High', 'Very High']
so_survey_df['boundary_binned'] = pd.cut(so_survey_df['ConvertedSalary'], bins, labels = labels)
so_survey_df[['boundary_binned', 'ConvertedSalary']].head()

  boundary_binned  ConvertedSalary
0             NaN              NaN
1          Medium          70841.0
2             NaN              NaN
3             Low          21426.0
4             Low          41671.0